-- a.)
SELECT AVG("Плата_бюро")
FROM "Бюро_найма"
         join "Трудовой_договор" Тд on "Бюро_найма"."Идентификатор" = Тд."Бюро_найма"
WHERE "Идентификатор" IN (SELECT Б."Идентификатор"
                          FROM "Бюро_найма" Б
                                   join "Трудовой_договор" Т on "Бюро_найма"."Идентификатор" = Т."Бюро_найма"
                                   join "Наниматель" Н on Н."Идентификатор" = Т."Наниматель"
                          GROUP BY Б."Идентификатор"
                          HAVING COUNT("Место_расположения" = 'Одесса') =
                                 (SELECT COUNT(*) FROM "Наниматель" Н2 WHERE Н2."Место_расположения" = 'Одесса'));

-- b.)
SELECT SUM("Оплата")
FROM "Трудовой_договор";

-- c.)
SELECT COUNT(DISTINCT "Профессии"."Название")
FROM "Профессии"
         join "Трудовой_договор" Тд on "Профессии"."Идентификатор" = Тд."Профессия"
         join "Наниматель" Н on Н."Идентификатор" = Тд."Наниматель"
WHERE "Место_расположения" = 'Н.Новгород'
  AND "Дата" < DATE '2020-01-01';

-- d.)
SELECT AVG(count)
FROM (SELECT SUM("Количество_вакансий") AS count
      FROM "Трудовой_договор"
               JOIN "Профессии" П on П."Идентификатор" = "Трудовой_договор"."Профессия"
      WHERE "Стоимость_найма_руб" > 20000
      GROUP BY "Профессия") AS countings;