-- a.)
SELECT "Название" AS Предприятие,
       "Номер"    AS Бюро_найма,
       SUM("Оплата")
FROM "Наниматель"
         JOIN "Трудовой_договор" Тд on "Наниматель"."Идентификатор" = Тд."Наниматель"
         JOIN "Бюро_найма" Бн on Бн."Идентификатор" = Тд."Бюро_найма"
GROUP BY "Название", "Номер";

-- b.)
SELECT "Номер"                 AS Бюро_найма,
       COUNT("Номер_договора") AS Количество_договоров
FROM "Бюро_найма"
         JOIN "Трудовой_договор" Тд on "Бюро_найма"."Идентификатор" = Тд."Бюро_найма"
GROUP BY "Номер"
HAVING COUNT("Номер_договора") > 2;

-- c.)
SELECT "Место_расположения", COUNT(*) AS Количество_предприятий
FROM "Наниматель"
GROUP BY "Место_расположения"
HAVING COUNT(*) > 0;

-- d.)
SELECT EXTRACT(MONTH FROM "Дата") AS Номер_месяца,
       "Номер"                    AS Бюро_найма,
       SUM("Оплата")              AS Суммарная_оплата
FROM "Трудовой_договор"
         JOIN "Бюро_найма" Бн on Бн."Идентификатор" = "Трудовой_договор"."Бюро_найма"
GROUP BY EXTRACT(MONTH FROM "Дата"), "Номер"
HAVING SUM("Оплата") > 200000
ORDER BY EXTRACT(MONTH FROM "Дата");