-- a.)
SELECT DISTINCT "Номер" AS Номер_бюро
  FROM "Бюро_найма"
       JOIN "Трудовой_договор" Тд on "Бюро_найма"."Идентификатор" = Тд."Бюро_найма"
 WHERE "Наниматель" IN (
     SELECT "Идентификатор"
       FROM "Наниматель"
      WHERE "Место_расположения" = 'Н.Новгород'
     );

-- b.)
SELECT DISTINCT "Название" AS Профессия
  FROM "Профессии"
 WHERE "Идентификатор" NOT IN (
     SELECT DISTINCT "Профессии"."Идентификатор"
       FROM "Профессии"
            JOIN "Трудовой_договор" Тд on "Профессии"."Идентификатор" = Тд."Профессия"
            JOIN "Наниматель" Н on Н."Идентификатор" = Тд."Наниматель"
      WHERE "Льгота_процент" < 10
     );

-- c.)
-- -- 7.a.)
SELECT "Дата" AS Дата_договора,
       "Номер_договора",
       Н."Название" AS Название_предприятия
FROM "Трудовой_договор"
         JOIN "Наниматель" Н ON Н."Идентификатор" = "Трудовой_договор"."Наниматель"
WHERE "Номер_договора" IN (
    SELECT "Номер_договора"
      FROM "Трудовой_договор"
           JOIN "Профессии" П on П."Идентификатор" = "Трудовой_договор"."Профессия"
           JOIN "Наниматель" Н2 on Н2."Идентификатор" = "Трудовой_договор"."Наниматель"
     WHERE П."Название" = 'Автоводитель'
           OR "Оплата" * "Трудовой_договор"."Количество_вакансий" >= 14000
     );
-- -- 7.b.)
SELECT "Номер" AS Номер_бюро,
       "Адрес_конторы" AS Адрес
  FROM "Бюро_найма"
 WHERE "Идентификатор" IN (
     SELECT "Бюро_найма"."Идентификатор"
       FROM "Бюро_найма"
            JOIN "Трудовой_договор" Тд on "Бюро_найма"."Идентификатор" = Тд."Бюро_найма"
            JOIN "Наниматель" Н on Н."Идентификатор" = Тд."Наниматель"
      WHERE "Льгота_процент" < 7
            AND "Дата" >= DATE '2020-03-01'
     );